[
  {
    "sentence": "Over the holidays my family kept asking me about all the tips and tricks that I have learned from others over the course of my treatment in order to pass along to someone else they knew going through this journey.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Usually lumpectomies don't have wound drains, but mastectomies do, so the rest of the advice below is geared more towards the mastectomy experience.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "If you have a nipple-sparing mastectomy they may give you nitroglycerine ointment to put on your nipples to stimulate blood flow and in that scenario you NEED to wear gloves to apply it.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "My family and friends make fun of me because once I was told I was going to need chemotherapy I bought a 64 oz water bottle from Amazon with a bunch of handles and straps attached to it and carried that thing around like a toddler with their favorite stuffie.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "It'll help prevent/lessen mouth sores.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "It will make a big difference later on because your scalp gets really tender when the hair starts falling out and having buzzed hair makes it easier to manage.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Lemon and/or ginger hard candies are fantastic, they will help with the bad chemo taste\n13.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Similar to the hard candies, I found queasy lozenges (otherwise known as queasy drops) helpful\n14.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "The steroids they put you on will stimulate your appetite and cause swelling.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "During and after chemo I switched from shampoo to hair cleanser.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Chemo will dry your skin out like nuts.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Make sure you have moisturizers on hand for your face and body and that these moisturizers are all scent free and made for sensitive skin.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "You will probably end up with some weird side effects you never anticipated.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "For me, one of the weirdest ones was muscle hypersensitivity in the first week after each infusion.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "The first week of my second infusion is the only time in my life I ever threw out my back, and my back went out from sitting weird in a hospital bed when I was being treated for Neutropenia.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "If you have questions related to sexual health during chemotherapy, I recommend asking your gynecologist (or urologist if you are male).",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Don't switch between products during this time.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Soft, loose-fitting shirts without irritating seams on the inside (especially by the armpit) are a must because your skin will eventually become very sensitive with the more rounds you do.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "I strongly recommend finding a class on nutrition run by a hospital or reputable health care organization, because there is *so much* junk science out there about nutrition and cancer and it can be hard sometimes to know what is real science and what is woo-woo nonsense.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "Instagram: A few reputable people I follow on Instagram are Dr Eleonora Teplinsky (@drteplinsky), breastcancerorg (@breastcancerorg), and u/DrHeatherRichardson's account (@bedfordbreastcenter)\n   2.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "I've been on Tamoxifen for six months now and thankfully haven't really had any side effects aside from some minor joint pain.",
    "source_text": "Over the holidays my family kept asking me about all the tips and tricks that I ..."
  },
  {
    "sentence": "33m, had a lumpectomy last week, surgeon called me with the pathology report tonight.",
    "source_text": "33m, had a lumpectomy last week, surgeon called me with the pathology report ton..."
  },
  {
    "sentence": "I had it when I did because I had skin and size changes on my breast then my doctor ordered one.",
    "source_text": "I had a family member ask me did I not get a mammogram earlier after telling the..."
  },
  {
    "sentence": "They had left a section (maybe 1 m by 3m in size) of ditch near the road uncut because it had flowers (weeds) growing in it (and we like butterflies) - which I had told them needed to be properly cut and they were going to do it today or tomorrow … \n\nAnyway when I  got the call I was outside trying to help with cleaning out the car.",
    "source_text": "So I had a shitty day. I am 3 weeks post DMX and have iron bra syndrome so sleep..."
  },
  {
    "sentence": "It makes me sad now because clearly I live in a community that doesn’t take time to notice neighbours in hardship, let alone reaching out a helping hand.",
    "source_text": "So I had a shitty day. I am 3 weeks post DMX and have iron bra syndrome so sleep..."
  },
  {
    "sentence": "I do think I would notice a neighbour going through changes like I have and cut them some slack.",
    "source_text": "So I had a shitty day. I am 3 weeks post DMX and have iron bra syndrome so sleep..."
  },
  {
    "sentence": "They are going to downsize from 7 employees to 2 for this role.",
    "source_text": "I attended a meeting yesterday that basically said the organisation is restructu..."
  },
  {
    "sentence": "Pathologic analysis of the tissue obtained from the right 10 o'clock axis, 10 cm from nipple shows:\n\nModerately differentiated invasive ductal carcinoma.",
    "source_text": "Pathologic analysis of the tissue obtained from the right 10 o'clock axis, 10 cm..."
  },
  {
    "sentence": "Now I am told that it could just be cryptogenic (of unknown origin), but before they give up they want me to try a “cancer drug holiday” of 4 months or switch to an AI after a 6 week Tamoxifen flush.",
    "source_text": "I would love to know if anyone has experienced Organizing Pneumonia as a rare si..."
  },
  {
    "sentence": "My oncologist has been extremely hard to convince to even consider this change.",
    "source_text": "I would love to know if anyone has experienced Organizing Pneumonia as a rare si..."
  },
  {
    "sentence": "I have had tine to research and the waits were hard.",
    "source_text": "I just got diagnosed and meet for my treatment plan in two weeks.  It’s been slo..."
  },
  {
    "sentence": "I feel like a weirdo because I have seen neighbors with meal trains, cooked and helped support networks etc but I can’t reconcile that with me now on the other end.",
    "source_text": "I just got diagnosed and meet for my treatment plan in two weeks.  It’s been slo..."
  },
  {
    "sentence": "Its been hard to balance school, family responsibilities, and my own mental health.",
    "source_text": "Hey..\nIm 16 and living with my younger sister and mom, who was recently diagnose..."
  },
  {
    "sentence": "How did you balance emotional burnout?",
    "source_text": "Hey..\nIm 16 and living with my younger sister and mom, who was recently diagnose..."
  },
  {
    "sentence": "I’m in pain.",
    "source_text": "Double mastectomy two weeks ago. I’m in pain. I hate this. ..."
  },
  {
    "sentence": "Its weird to not go to the hospital practically daily anymore, and I cant help but feel like i should be doing more.",
    "source_text": "I completed chemo, surgery and finally radiation. I still feel incredibly tired ..."
  },
  {
    "sentence": "That said, my main worry I suppose is the absorption of any oral meds, particularly when needed for bone pain after GCSF, steroids, that kind of thing.",
    "source_text": "Hi everyone,\n\nI am looking for anecdotal/real life experiences of taking Mounjar..."
  },
  {
    "sentence": "I asked my surgeon about pain management, in that I've heard that muscle relaxers are better at managing this kind of pain (post dmx) than opiates.",
    "source_text": "I work at one of the best pediatric hospitals in the country.  I get annoyed whe..."
  },
  {
    "sentence": "I’ve narrowed my treatment choices to either DMX to flat or lumpectomy with radiation.",
    "source_text": "I have IDC Stage 1 ++-.\n\nI’ve narrowed my treatment choices to either DMX to fla..."
  },
  {
    "sentence": "I actually thought I had decided on the lumpectomy but now I’m thinking DMX.",
    "source_text": "I have IDC Stage 1 ++-.\n\nI’ve narrowed my treatment choices to either DMX to fla..."
  },
  {
    "sentence": "Hubby thinks lumpectomy is a no-brainer since the survival rate is the same for both.",
    "source_text": "I have IDC Stage 1 ++-.\n\nI’ve narrowed my treatment choices to either DMX to fla..."
  },
  {
    "sentence": "I also have been having bone pain from lapelga and was told to take Claritin to help with that but maybe weed could help too?",
    "source_text": "Hi all, I have just finished my 4th dose sense of AC chemo round today (last A/C..."
  },
  {
    "sentence": "The only effect I have today is normal muscle pain.",
    "source_text": "I mentioned on a couple of posts that I just finished radiation and was planning..."
  },
  {
    "sentence": "I did end up having to pad the surgical/boost site from my backpack strap rubbing on it but I caught the developing hot spot early and it's fine today.",
    "source_text": "I mentioned on a couple of posts that I just finished radiation and was planning..."
  },
  {
    "sentence": "I had a lumpectomy April 16th.",
    "source_text": "I mentioned on a couple of posts that I just finished radiation and was planning..."
  },
  {
    "sentence": "I am not a hard core athlete but I have gotten a lot fitter since diagnosis.",
    "source_text": "I mentioned on a couple of posts that I just finished radiation and was planning..."
  },
  {
    "sentence": "He *thinks* I’m stage 2 based on size + no enlarged lymph nodes (scans next week).",
    "source_text": "So I’m very newly diagnosed- first meeting with oncologist today. He *thinks* I’..."
  },
  {
    "sentence": "But my shoulder behind that breast is sore- Advil takes care of it and I think it’s just residual from the biopsy but there’s a part of me that is worried it’s something more…",
    "source_text": "So I’m very newly diagnosed- first meeting with oncologist today. He *thinks* I’..."
  },
  {
    "sentence": "I found the lump back in early June.",
    "source_text": "Hi- I’m 2 months into 30 and just got diagnosed on 7/24. I found the lump back i..."
  },
  {
    "sentence": "I am 50 years old was diagnosed with IDC stage 2 in October of 24- I had a DMX with immediate reconstruction  on 12/2/24 healed well from that minimal pain.",
    "source_text": "I am 50 years old was diagnosed with IDC stage 2 in October of 24- I had a DMX w..."
  },
  {
    "sentence": "I have horrible pain in the radiated breast it feels super tight and throbs most of the time.",
    "source_text": "I am 50 years old was diagnosed with IDC stage 2 in October of 24- I had a DMX w..."
  },
  {
    "sentence": "It’s super annoying my oncologist says it’s normal and takes about 6 months to a year for your skin to heal.",
    "source_text": "I am 50 years old was diagnosed with IDC stage 2 in October of 24- I had a DMX w..."
  },
  {
    "sentence": "Im 28 and I have IDC (most likely stage 1), and I'm terrified of going through menopause with hormone blockers, especially because I have a connective tissue disorder that already gives me hot flashes and joint pain, and because I've struggled with eating disorders throughout my life I'm worried about the weight gain around the stomach too... What has your experience been?",
    "source_text": "Im 28 and I have IDC (most likely stage 1), and I'm terrified of going through m..."
  },
  {
    "sentence": "However, close to cycle 2, I got a phone call that a radiologist wasn’t so sure from my MRI results of the breasts as there was a slight lesion in the breast bone area.",
    "source_text": "Hi there,\n\nRecently new to the community. 25 yr old with an 11 week old baby. Di..."
  },
  {
    "sentence": "I met with a breast oncologist specialist who told me that doing it now could potentially lead to a false negative as if there was anything there and since the lesion is so small, the chemo could’ve gotten it (if any).",
    "source_text": "Hi there,\n\nRecently new to the community. 25 yr old with an 11 week old baby. Di..."
  },
  {
    "sentence": "I had plastic surgery on Dec 19,2024 and my nipples were removed and put back on with lollipop stitches.",
    "source_text": "I finished 6 weeks of radiation on April 1,\n2025. I had plastic surgery on Dec 1..."
  },
  {
    "sentence": "My tumor was very proximate to my left nipple and surgeon noted pre surgery that “it might not make it” since the plastic surgeon had to cut additional margin for the tumor.",
    "source_text": "I finished 6 weeks of radiation on April 1,\n2025. I had plastic surgery on Dec 1..."
  },
  {
    "sentence": "All that info to ask my question - all of these weeks post radiation, my left nipple is still brown, and seems to be getting worse or simply nowhere near returning to normal.",
    "source_text": "I finished 6 weeks of radiation on April 1,\n2025. I had plastic surgery on Dec 1..."
  },
  {
    "sentence": "I have used many types of oils, salves, creams, lotion to try and make any positive changes.",
    "source_text": "I finished 6 weeks of radiation on April 1,\n2025. I had plastic surgery on Dec 1..."
  },
  {
    "sentence": "Likely swirling here but really trying to understand if this nipple is my new normal ….",
    "source_text": "I finished 6 weeks of radiation on April 1,\n2025. I had plastic surgery on Dec 1..."
  },
  {
    "sentence": "My double mastectomy (nipple sparing with tissue expanders) is this Friday, as in 3 days from now.",
    "source_text": "My double mastectomy (nipple sparing with tissue expanders) is this Friday, as i..."
  },
  {
    "sentence": "With gratitude for this great group, I am not looking for “it’s not that bad” or “I hardly miss it” reassurance.",
    "source_text": "My double mastectomy (nipple sparing with tissue expanders) is this Friday, as i..."
  },
  {
    "sentence": "Fingers crossed for continued shrinkage before surgery 🤞",
    "source_text": "Hi All, just wanting to share my results from my progress mammogram and ultra so..."
  },
  {
    "sentence": "I’m in my 50’s and DD bra size.",
    "source_text": "I had SMX w/expander placement. I’m still undecided about reconstruction. I’m in..."
  },
  {
    "sentence": "Does anyone have links or brands of bras that have good lift for someone my size and age?",
    "source_text": "I had SMX w/expander placement. I’m still undecided about reconstruction. I’m in..."
  },
  {
    "sentence": "What do you do to stay even and balanced when you’re my size?",
    "source_text": "I had SMX w/expander placement. I’m still undecided about reconstruction. I’m in..."
  },
  {
    "sentence": "I googled and both seem to be symptoms.",
    "source_text": "Hi all….so I have done some poking around searching for side effects and none se..."
  },
  {
    "sentence": "Just returned from my oncologist appointment post lumpectomy (stage 1b, grade 2, er/pr +, her-) and they gave me the go ahead to start tamoxifen while I wait for radiation.",
    "source_text": "Just returned from my oncologist appointment post lumpectomy (stage 1b, grade 2,..."
  },
  {
    "sentence": "I have this sensation on the underside of my arms that feels very much like a painful sunburn.",
    "source_text": "Title pretty much says it all. I have this sensation on the underside of my arms..."
  },
  {
    "sentence": "It's incredibly intense (read: painful) when touched.",
    "source_text": "Title pretty much says it all. I have this sensation on the underside of my arms..."
  },
  {
    "sentence": "I can choose between lumpectomy or various forms of mastectomy.",
    "source_text": "I need help weighing options.\n\nI have Stage 1 IDC ++-.\nI can choose between lump..."
  },
  {
    "sentence": "That’s an important factor in my decision, bc a DMX will require a lot more downtime for me and make it harder on our child and other people around me, as they’d have to come help take care of him.",
    "source_text": "I need help weighing options.\n\nI have Stage 1 IDC ++-.\nI can choose between lump..."
  },
  {
    "sentence": "Im leaning towards lumpectomy bc of the easier surgery, by far, BUT there could be major financial implications if I present with another breast cancer after hubby retires in early 2027 and we are on Medicare at that point.",
    "source_text": "I need help weighing options.\n\nI have Stage 1 IDC ++-.\nI can choose between lump..."
  },
  {
    "sentence": "Now, 10 years later, she has a lesion on her hand that has been there for over a month maybe longer.",
    "source_text": "I just need some place to vent, not about me, but I guess it is a little. My mom..."
  },
  {
    "sentence": "She has decided to trust Chatgpt to diagnose her skin lesion as \"just a cyst\" and canceled her Dr. appointment to get it looked at.",
    "source_text": "I just need some place to vent, not about me, but I guess it is a little. My mom..."
  },
  {
    "sentence": "That she has a history of skin cancer, has a 38 year daughter who has just gone through breast cancer, and still taking treatments, and she is not going to the Dr.?!",
    "source_text": "I just need some place to vent, not about me, but I guess it is a little. My mom..."
  },
  {
    "sentence": "Dear Ladies, fighting this dreaded disease is so hard.",
    "source_text": "Dear Ladies, fighting this dreaded disease is so hard. For those who have had se..."
  },
  {
    "sentence": "Other side effects included headache, extreme acidic reflux, stomach pain.",
    "source_text": "My mom (53) is diagnosed with IDC, grade-2, ER/PR+, HER-, Ki67-11%. Oncologist s..."
  },
  {
    "sentence": "I have read docetaxel is waaay harder to tolerate than Paclitaxel.",
    "source_text": "My mom (53) is diagnosed with IDC, grade-2, ER/PR+, HER-, Ki67-11%. Oncologist s..."
  },
  {
    "sentence": "The tumour does look like it's taken a beating though and it's a sadder, skinner fucker now.",
    "source_text": "Hey everyone. I have finally finished chemo. My original tumour was 21mm, shrunk..."
  },
  {
    "sentence": "I suppose I'm asking for anyone who had residual showing on imaging whether the pathology results were fairly okay?",
    "source_text": "Hey everyone. I have finally finished chemo. My original tumour was 21mm, shrunk..."
  },
  {
    "sentence": "But I've seen some hopeful posts here from folks saying that using cuticle oil and/or Hard as Hoof really helped preserve theirs throughout treatment, thankfully!",
    "source_text": "Hi all!\n\nI've searched through some past posts about nail experiences during che..."
  },
  {
    "sentence": "Is the Hard as Hoof folks have referenced made by Onyx Professional, or is it something else?",
    "source_text": "Hi all!\n\nI've searched through some past posts about nail experiences during che..."
  },
  {
    "sentence": "On a whim I purchased an Essie \"Hard to Resist\" nail strengthener, but I've always been a bit skeptical of putting chemicals on my nails and I'm nervous to try this one.",
    "source_text": "Hi all!\n\nI've searched through some past posts about nail experiences during che..."
  },
  {
    "sentence": "I'm planning to start using cuticle oil ASAP, and the Hard as Hoof product once I know I've got the right one.",
    "source_text": "Hi all!\n\nI've searched through some past posts about nail experiences during che..."
  },
  {
    "sentence": "My mother-in-law had a lumpectomy a few weeks ago and recently found out the cancer had spread beyond the margins.",
    "source_text": "My mother-in-law had a lumpectomy a few weeks ago and recently found out the can..."
  },
  {
    "sentence": "Thankfully it didn't come out but my god the pain!!!",
    "source_text": "OMG ya'll that scared the shit out of me. Thankfully it didn't come out but my g..."
  },
  {
    "sentence": "I'm afraid of a local recurrence since I previously had it come back on the skin.",
    "source_text": "\nThe moles on my breast look darker, and some of them are peeling after radiothe..."
  },
  {
    "sentence": "Has anyone else experienced mole changes after radiation?",
    "source_text": "\nThe moles on my breast look darker, and some of them are peeling after radiothe..."
  },
  {
    "sentence": "It’s like people hear “stage 1” and think I should be fine after the lumpectomy.",
    "source_text": "It’s like people hear “stage 1” and think I should be fine after the lumpectomy...."
  },
  {
    "sentence": "Some days I feel almost normal, minus the random shooting pain.",
    "source_text": "It’s like people hear “stage 1” and think I should be fine after the lumpectomy...."
  },
  {
    "sentence": "From April to June, I had 6 biopsies, 2 lumpectomies, 2 sentinel nodes removed, + + —.",
    "source_text": "It’s like people hear “stage 1” and think I should be fine after the lumpectomy...."
  },
  {
    "sentence": "A post-op torso CT scan to rule out metastasis that came back… weird.",
    "source_text": "It’s like people hear “stage 1” and think I should be fine after the lumpectomy...."
  },
  {
    "sentence": "Nipple sparing BMX with tissue expanders to silicone implants.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "Survivorship was hard for the first two years.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "Hot flashes, night sweats, constant joint pain, fatigue in the beginning.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "I manage the joint pain by taking Cymbalta (bonus is it treats my depression and anxiety), joint health supplement, tart cherry juice pill, and Claritin daily.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "The hardest part was losing my eyebrows and eyelashes.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "Two and a half years later, my brows are non-existent, my lashes are thin, and my hair has thin spots.",
    "source_text": "ETA: Diagnosed three weeks before turning 40, am 43 now.\n\nHi all, I'm 2.5 years ..."
  },
  {
    "sentence": "I had a lumpectomy and sentinel node biopsy 5 months ago.",
    "source_text": "I had a lumpectomy and sentinel node biopsy 5 months ago. My upper arm still fee..."
  },
  {
    "sentence": "My upper arm still feels so weird!",
    "source_text": "I had a lumpectomy and sentinel node biopsy 5 months ago. My upper arm still fee..."
  },
  {
    "sentence": "It keeps itching and when I rub or scratch the area, I can't really feel anything (other than the itching).",
    "source_text": "I had a lumpectomy and sentinel node biopsy 5 months ago. My upper arm still fee..."
  },
  {
    "sentence": "My eyelashes look like an old ragged paintbrush - broken in half, scraggly and missing completely in random spaces.",
    "source_text": "I’m one year out from all my treatments (2b, ++-); I’ve have chemo, surgery, bre..."
  },
  {
    "sentence": "Pain is 1 out of 10.",
    "source_text": "My DMX (DCIS grade 3) was this morning.  Recovery is good so far.  I had a nerve..."
  },
  {
    "sentence": "Except…\n\nI’m wondering about this sore throat.",
    "source_text": "My DMX (DCIS grade 3) was this morning.  Recovery is good so far.  I had a nerve..."
  },
  {
    "sentence": "Nurse says it’s normal from the anesthesia, but this feels like a sore throat from a cold.",
    "source_text": "My DMX (DCIS grade 3) was this morning.  Recovery is good so far.  I had a nerve..."
  },
  {
    "sentence": "I don’t have cold symptoms, so could the anesthesia really cause a sore throat like this?",
    "source_text": "My DMX (DCIS grade 3) was this morning.  Recovery is good so far.  I had a nerve..."
  },
  {
    "sentence": "Does that change longterm survival numbers?",
    "source_text": "Hi chat, so here we are. Six weeks after dmx, good margins, 1 node positive. Tis..."
  },
  {
    "sentence": "Oh well, I am glad rads is done- the driving every day was hard!!",
    "source_text": "38F, IDC ++-, had surgery (2 including port), 4 chemo rounds and just finished r..."
  },
  {
    "sentence": "That was a massive relief!",
    "source_text": "Hi, all. I'm really waffling about this decision and hoping to hear from those o..."
  },
  {
    "sentence": "So annoying, watering and twitching all day.",
    "source_text": "My eyes have been watering following my 3/4 chemo. I finished on the 16th. WILL ..."
  },
  {
    "sentence": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has been nothing but helpful so far.",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "I have DCIS and a lumpectomy scheduled for next week, with radiation starting about a month after.",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "I just wanted to take pictures to remember my body before it changes.",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "I could edit the marks and bruises out of the picture, or use concealer but I don’t want that to make the markings disappear entirely by mistake.",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "I could also wait a few weeks after my lumpectomy and hope that my incision isn’t too bad.",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "I mainly want to document them prior to radiation since that is what will change them the most",
    "source_text": "Ok so….hopefully this isn’t weird to ask, but I doubt it because this group has ..."
  },
  {
    "sentence": "Well over the weekend my bruising was getting worse and last night I texted my surgeon because we were already kinda worried about my nipple healing(it does look better over the last few days luckily).",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "My entire breast is a bruise at this point, not red and purple like a fresh bruise but almost like a brown old looking bruise but it is so traumatic to look at.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "It’s almost like any point my breast tissue was removed is bruised.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "He had me come in today and he said I’m still getting blood flow and is having me do an ultrasound tomorrow morning to see if there is any fluid to be removed.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "I’m so frustrated, I have always been a notorious awful bruiser.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "Like to the extent that my cheeks were bruised for almost a month after my wisdom teeth extraction.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "He said worst case my expander comes out and my skin heals then expander goes back in.",
    "source_text": "Just feeling the need to vent because it literally is always something. I am 2 w..."
  },
  {
    "sentence": "My oncologist was thrilled at the Signutara result and admitted that they aren’t exactly sure how to interpret the Northstar result, but they will continue giving me this test to see if my result changes.",
    "source_text": "I had breast cancer, Stage 1B. I had a double mastectomy.\n\nI recently had both t..."
  },
  {
    "sentence": "In case I’m breaking any rules, I’m not asking anyone to interpret my results, rather to share their own experiences with similar tests.",
    "source_text": "I had breast cancer, Stage 1B. I had a double mastectomy.\n\nI recently had both t..."
  },
  {
    "sentence": "My fingers are swollen, sore, and my fingernails are starting to peel away from the nail bed.",
    "source_text": "Hi everyone,\nI’m currently going through chemo (Adriamycin aka “Red Devil” + Cyt..."
  },
  {
    "sentence": "I have been diagnosed with IDC Grade 3 (2cm mass) and now the receptor stuff is in My Chart.",
    "source_text": "I have been diagnosed with IDC Grade 3 (2cm mass) and now the receptor stuff is ..."
  },
  {
    "sentence": "I’ve seen posts about being ++- - and such - “my” mass has estrogen &amp; progesterone receptors and I think the Hers2 is (-).",
    "source_text": "I have been diagnosed with IDC Grade 3 (2cm mass) and now the receptor stuff is ..."
  },
  {
    "sentence": "I tend to react very weirdly to many meds that could be helpful, and this stuff scares me more than surgery does.",
    "source_text": "I have been diagnosed with IDC Grade 3 (2cm mass) and now the receptor stuff is ..."
  },
  {
    "sentence": "I completed six rounds of TCHP and then had partial mastectomy (lumpectomy) with sentinel node biopsy.",
    "source_text": "Hi! Just wanted to share my exciting news and give hope to anyone searching the ..."
  },
  {
    "sentence": "It was so hard and after the third infusion I wanted to quit.",
    "source_text": "Hi! Just wanted to share my exciting news and give hope to anyone searching the ..."
  },
  {
    "sentence": "I’m forever grateful for my body’s response and am taking this as a wake up call to change my life for the better.",
    "source_text": "Hi! Just wanted to share my exciting news and give hope to anyone searching the ..."
  },
  {
    "sentence": "I know I should be grateful for this diagnosis as others are going through so much more but it’s hard to stop this ruminating….",
    "source_text": "New here, I’m 58 yo, recent diagnosed with invasive lobular cancer ER/PR+, Her2-..."
  },
  {
    "sentence": "They want me to think positive and fight hard.",
    "source_text": "Please be kind, don't scold me and please do not scare me. I need lifting up. \nI..."
  },
  {
    "sentence": "I went for an mri for my back pain I've had 6 months.",
    "source_text": "Please be kind, don't scold me and please do not scare me. I need lifting up. \nI..."
  },
  {
    "sentence": "And found a mass on my liver &amp; spine.",
    "source_text": "Please be kind, don't scold me and please do not scare me. I need lifting up. \nI..."
  },
  {
    "sentence": "Also, still waiting on another biopsy of another spot they found, which I’m told could be a completely different cancer.",
    "source_text": "Ok. IDC ++- with ki67 high (45%) and I was told mammaprint says “chemo would be ..."
  },
  {
    "sentence": "She is not quite 70 but close, and her cancer is grade 1 with no lymph involvements (size around 22mm although it's oblong and I kind of feel like she got unfairly classified into stage 2, since it's like 22x15x8 or something like that!)",
    "source_text": "Hi everyone, \n\nMy mom was diagnosed with breast cancer and it was determined to ..."
  },
  {
    "sentence": "We're all hoping for no chemo (it really does feel that we're headed that way) but at the same time I feel like not asking for Oncotype DX is not being thorough enough...",
    "source_text": "Hi everyone, \n\nMy mom was diagnosed with breast cancer and it was determined to ..."
  },
  {
    "sentence": "I also worry that asking for that score will further delay her treatment (it's already been 6 weeks since her lumpectomy... Yay Canada!)",
    "source_text": "Hi everyone, \n\nMy mom was diagnosed with breast cancer and it was determined to ..."
  },
  {
    "sentence": "It has now slid back from the layer of skin and towards my arm pit and is kinda and inch ish and blobular now.",
    "source_text": "Long time no check in. I just had my head down trying to get through the chemo. ..."
  },
  {
    "sentence": "I am mind blown that it reacted so well that I got the choice to choose a lumpectomy which I chose over a mastectomy !",
    "source_text": "Long time no check in. I just had my head down trying to get through the chemo. ..."
  },
  {
    "sentence": "I had a hard time getting out of bed on Saturday due to bone pain.",
    "source_text": "Physically I expected to feel fatigued- I’m 6 days my first post chemo sesh (TC...."
  },
  {
    "sentence": "It feels like since I was caught “early” I should have more gratitude, more optimism, less pain.",
    "source_text": "Physically I expected to feel fatigued- I’m 6 days my first post chemo sesh (TC...."
  }
]